In [27]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series
from numpy.random import randn

In [5]:
data=Series(["A","B",np.NAN,"D"])

In [6]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
data.dropna()

0    A
1    B
3    D
dtype: object

In [8]:
data

0      A
1      B
2    NaN
3      D
dtype: object

In [23]:
dframe=DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,12]])

In [24]:
dframe

     0    1   2
0  1.0  2.0   3
1  NaN  5.0   6
2  7.0  NaN   9
3  NaN  NaN  12

In [18]:
dframe.dropna(how="any")

     0    1  2
0  1.0  2.0  3

In [20]:
dframe.dropna(how="any",axis=1)

    2
0   3
1   6
2   9
3  12

In [25]:
dframe.fillna({0:0,1:1,2:2,3:3})

     0    1   2
0  1.0  2.0   3
1  0.0  5.0   6
2  7.0  1.0   9
3  0.0  1.0  12

In [21]:
dframe.dropna(thresh=2,inplace=True)

In [22]:
dframe

     0    1  2
0  1.0  2.0  3
1  NaN  5.0  6
2  7.0  NaN  9

In [38]:
ser=Series(randn(6),index=[[1,1,1,2,2,2],list("abcabc")])

In [39]:
ser

1  a    0.173174
   b    1.733420
   c   -2.544954
2  a    2.618350
   b    0.474892
   c    1.624326
dtype: float64

In [40]:
ser[:,"a"]

1    0.173174
2    2.618350
dtype: float64

In [41]:
ser[1]

a    0.173174
b    1.733420
c   -2.544954
dtype: float64

In [42]:
ser.unstack()

          a         b         c
1  0.173174  1.733420 -2.544954
2  2.618350  0.474892  1.624326

In [51]:
comlexdf=DataFrame(np.arange(16).reshape(4,4),
                  index=[["a","a","b","b"],[1,2,3,4]],
                  columns=[["NY","NY","SF","LA"],["Cold","HOT","HOT","COLD"]])

In [52]:
comlexdf

      NY      SF   LA
    Cold HOT HOT COLD
a 1    0   1   2    3
  2    4   5   6    7
b 3    8   9  10   11
  4   12  13  14   15

In [53]:
comlexdf.columns.names=["cities","weather"]

In [54]:
comlexdf

cities    NY      SF   LA
weather Cold HOT HOT COLD
a 1        0   1   2    3
  2        4   5   6    7
b 3        8   9  10   11
  4       12  13  14   15

In [59]:
comlexdf.swaplevel("cities","weather",axis=1)

weather Cold HOT     COLD
cities    NY  NY  SF   LA
a 1        0   1   2    3
  2        4   5   6    7
b 3        8   9  10   11
  4       12  13  14   15

In [60]:
comlexdf

cities    NY      SF   LA
weather Cold HOT HOT COLD
a 1        0   1   2    3
  2        4   5   6    7
b 3        8   9  10   11
  4       12  13  14   15

In [63]:
comlexdf.sort_index(level=0,axis=1)

cities    LA   NY      SF
weather COLD Cold HOT HOT
a 1        3    0   1   2
  2        7    4   5   6
b 3       11    8   9  10
  4       15   12  13  14